# Aula 3 - Pandas

Nessa aula, iremos tratar dos seguintes conteúdos:
- Numpy Matrizes
- Métodos de Matrizes Numpy
- Pandas
- Series
- Métodos Pandas
- DataFrames
- Trabalhando com CSVs

<img src="" width=800>

Utilize comprehension para gerar a lista de todos os números pares entre 0 e 19. Converta a lista em um __numpy__ array e cálcule a média.

In [ ]:
import numpy as np

numbers = [i for i in range(0, 20)]
numbers_arr = np.array(numbers)
numbers_avg = np.mean(numbers_arr)
print('Os números são', numbers_arr)
print('A média é', numbers_avg)

## Matrizes - Arrays Bidimensionais

In [ ]:
## Cria uma matriz usando o np.array

In [ ]:
## É possível fazer matrizes com as funções que já trabalhamos anteriormente

## zeros

## uns

## identidade

## linspace

Numpy arrays são objetos chamados _ndarrays_ e possuem diversos atributos 
- ndarray.ndim - número de eixos (dimensões) do array
- ndarray.shape - uma tupla de inteiros indicando o tamanho do array em cada dimensão
- ndarray.size - o número total de elementos do array
- ndarray.dtype - tipo dos elementos no array
- ndarray.itemsize - o tamanho em bytes de cada elemento do array
- ndarray.data - o buffer de memória contendo os elementos do array

In [ ]:
## Verifica o tipo

In [ ]:
## Vamos ver os atributos

## Métodos Numpy para matrizes

Vamos aprender agora alguns métodos muito úteis para serem aplicados em arrays, muitos desses métodos serão herdados pelo Pandas, então vão ter uma usabilidade bem grande:

__Método reshape:__  permite reformatar o array modificando o número de linhas e colunas, porém, a nova 'shape' tem que possuir o mesmo número de elementos do array original:

In [ ]:
## reshape

__Método ravel:__  concatena as linhas da matriz em um array unidimensional:

In [ ]:
## ravel

__Método flatten__: também concatena as linhas da matriz em um array unidimensional, porém, faz uma cópia dos elementos. O método ravel gera uma view, portanto se algum elemento for modificado, o array original também é modificado:

In [ ]:
## Flatten

__Transposta de Matriz:__ Ao calcular a tranposta da Matriz, inverte os valores das linhas pelas colunas de cada uma das posições:

In [ ]:
## Transposta

__Máscaras booleanas__ seguem valendo para matrizes:

In [ ]:
## Máscara
array = np.arange(18).reshape(3,6)
print("Matriz: ")
print(array)

## Exercício

1 - Faça um programa que peça para o usuário digitar o nome de um produto e seu preço, armazene esses dados em um array multidimensional. Em seguida, exiba esses dados na tela, de forma que a leitura fique facilitada.

2 - Usando o array criado no anterior, peça para o usuário digitar um indice de produto e retorne a linha correspondente do array com produtos e preços

## Pandas

__Pandas__ é um pacote python construído com base no __NumPy__ e __Matplotlib__ que busca organizar dados no formato de tabela, atribuindo rótulos às linhas e colunas. O pacote __Pandas__ fornece ainda um conjunto de funcionalidades que permite processar as informações de tabelas de forma bastante eficiente, implementando métodos fundamentais para fins de tratamento de dados.

O Pandas organiza os dados nos seguintes tipos de estruturas:
- Series (Séries)
- DataFrame

 O __Pandas__ é um pacote e para utilizarmos, devemos importá-lo para o nosso notebook da seguinte forma:

In [ ]:
# import da bibloteca do Pandas

import pandas as pd

##

### Series
A estrutura de representação tipo __Series__ do __Pandas__ é semelhante a um array unidimensional, porém os elementos podem ser indexados por números inteiros (como em um array do NumPy) ou por meio de rótulos (labels) que não precisam ser únicos e podem ser organizados de forma hierárquica.
- Quando os índices ou rótulos não são informados explicitamente, Pandas cria uma indexação com números inteiros automaticamente, variando os índices de $0$ (zero) a $n-1$, onde $n$ é o número de elementos na série.
- Os rótulos são usados para realizar buscas rápidas, alinhamento de dados e operações de junção de dados.

#### Criando séries com Pandas
Séries podem ser criadas no Pandas de diferentes formas, a partir de:
- Listas ou Arrays
- Dicionários
- DataFrames

### Utilizando Listas ou Arrays

In [ ]:
# Vamos criar uma Serie a partir de uma lista do Python


# Define a Serie


# Mostra o resultado para a Serie criada

Agora vamos criar uma Serie a partir de um __np.array__:

In [ ]:
# Vamos criar uma Serie a partir de uma lista do Python

# Cria um array usando a função np.array


# Cria a Serie a partir do array


# Mostra o resultado da Serie criada

### Utilizando Dicionários

In [ ]:
# Podemos criar Series a partir de Dicionarios tambem!

# Define o dicionario e seus elementos


# Cria a Serie a partir dee um dicionário


# Mostra o resultado da Serie criada

##

### Indexação

Assim como para os arrays, conseguimos acessar diversos elementos da __Serie__ a partir dos __índices:__

In [ ]:
# Plota o valor da serie na posição 3

In [ ]:
# Plota o valor da serie na posição 7

In [ ]:
# Cria um loop onde varre todos os elementos da Serie entre 0 e 8

Da mesma forma, conseguimos fazer o __Slicing__ em uma __Serie__:

In [ ]:
# Fatia a Serie até a posição 2

In [ ]:
# Fatia a Serie a partir da posição 4

##

### Labels

Uma característica especial das __Series__ é que podemos escolher quais os __índices__ que queremos atribuir para cada um dos elementos e acessá-los a partir da __nova identifcação__ deles:

In [ ]:
# Cria uma lista com os nomes dos indices/labels


# Cria a lista de elementos da Serie


# Cria a Serie passando os elementos dela e os indices


# Plota o resultado para a Serie criada

In [ ]:
#series2['a'] ## valor unico

 ##lista de valores

In [ ]:
# Podemos igualmente acessar os nossos dados usando os novos indices
# trazer da Serie apenas os elementos que estão nos indices b e d

##

### Operações Matemáticas

De maneira análoga ao que fizemos usando os __arrays__, pode-se fazer qualquer tipo de manipulação matemática utilizando as __Series__:

In [ ]:
# Podemos fazer manipulações matemáticas utilizando as Series
# Adicionando o valor 10 para cada elemento da Serie

In [ ]:
# Dividindo cada elemento da Serie por 5

In [ ]:
# Divide o valor 300 por cada um dos elementos da Serie

##

## Métodos Pandas

Justamente pela biblioteca __Pandas__ utilizando do NumPy para a construção da sua arquitetura, muito dos métodos que são nativos do NumPy também vão funcionar com o __Pandas__, além de alguns novos métodos que veremos a seguir:

In [ ]:
# Vamos agora criar uma série e armazenar notas de alunos da Let's Code

# Cria Serie com valores de notas para cada aluno
notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])

# Mostra o resultado da Serie criada
notas

__sort_values__: este método ordena a Serie de acordo com os valores númericos dos elementos:

In [ ]:
# Ordenar as notas pelo valor delas:

#notas.sort_values(ascending=True, inplace=True) -> Se quiser editar direto na serie passo esse "inplace=True"

__unique:__ este método retorna todos os __valores distintos__ dentro de uma __Serie__:

__nunique:__ este método retorna a quantidade de __valores distintos__ dentro de uma __Serie__:

__value_counts:__ este método retorna as __frequências (contagens)__ para cada um dos __elementos distintos__ dentro de uma Serie:

Podemos também ao invés de retorna as frequências, retornar as __proporções__ de cada um dos __elementos distintos__:

A seguir teremos alguns outros métodos já conhecidos do __NumPy__ que retorna algumas estatísticas básicas para a Serie:

In [ ]:
# calcula a soma das notas

In [ ]:
# Retorna o maior valor da Serie

In [ ]:
# Retorna o menor valor da Serie

In [ ]:
# Calcula a media das notas da Serie

In [ ]:
# Calcula o Desvio padrão das notas

In [ ]:
# Calcula a mediana das notas das Series (termo central dos valores)

In [ ]:
# Calcula a moda das notas (a nota mais frequente)

__describe:__ este é um método muito útil que vai trazer um resumos das __principais estátisticas__ da Serie que estamops trabalhando:

##

## Exercícios

**1)** Cria uma série de pandas que tenha os números inteiros de 0 a 100.

**2)** Considere uma série de notas de alunos:
 
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
Determine:

**a)** A nota média

**b)** O desvio padrão

**c)** A moda

**d)** A mediana

In [ ]:
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
#a


#b


#c


#d

## DataFrame

__DataFrames__ assim como na mesma analogia para as matrizes, são um __conjunto de Series__ que vão ser bem caracterizados pelo o seu formato tabular (o que facilita muito o processo de manipulação dos dados!):

In [ ]:
# Cria um dicionario com nomes de alunos e suas respectivas notas
dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],
              'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

# Cria um DataFrame a partir de um dicionario


# Mostra o resultado do DataFrame

Todo o processo que vimos sobre __indexação__ e __métodos__  para as Series são válidas também quando trabalhamos com __DataFrames:__

In [ ]:
# Retorna a coluna com os Nomes dos Alunos

In [ ]:
# Retorna a coluna com as notas dos Alunos

In [ ]:
print(df.index)

In [ ]:
## Filtro pelo indice

In [ ]:
## Acessando com a máscara

In [ ]:
# Calcula a média das notas dos alunos

In [ ]:
# Retorna o nome do aluno localizado na posição 1

In [ ]:
## Linha de racionio
## 1 - Decide a mascara (filtro) Ex df['Alunos'] == 'Rafael'
## 2 - Acessei o dataframe na mascara Ex: df[mascara]
## 3 - Se eu quiser só uma coluna eu peço ela logo em seguida df[mascara][coluna]

__Método loc:__ Este é um método especial para quando queremos acessar os elementos de um DataFrame, onde podemos acessar utilizando apenas os índices ou mesmo passando duas posições específicas:

In [ ]:
# Retorna com o loc os elementos da posição 2

In [ ]:
# Podemos usar o loc pra pegar um elemento em particular
# importante: a ordem é [linha, coluna]

## Máscaras Booleanas

Podemos fazer filtros no __DataFrame__ definindo como que para os arrays, as __máscaras booleanas:__

In [ ]:
# Chamando a coluna notas

In [ ]:
# Como o DataFrame é composto de varias Series, podemos utilizar-lo para fazer filtros
# Aplicando a mascara booleana a coluna notas

In [ ]:
# Retorna apenas os casos que satisfazem a condição

In [ ]:
# Outro exemplo de aplicação

## Exercícios

### Para o Dataframe de Alunos utilizado

**1)** Encontre a nota média dos alunos

**2)** A nota do Juca

**3)** Os alunos com nota menor que 6.5

**4)** Peça a descrição das notas para ter insights interessantes

**5)** A moda das notas acima de 7

##

##

## Trabalhando com CSVs

O __Pandas__ tem algumas funcionalidades bem interessantes, como por exemplo permitir que carregue para o Notebook arquivos no formato csv, excel, xlsx e etc. Vamos ver uma aplicação como o CSV:

In [9]:
# Carrega um arquivo CSV
df = pd.read_csv('titanic.csv')

# Print do DataFrame
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

[Neste Link](https://www.kaggle.com/c/titanic/data), conseguimos mais informações sobre a base de dados do Titanic! O Kaggle é uma plataforma muito conheciida no quesito de competições de Data Science e Machine Learning, além de disponibilizar diversos conjuntos de dados para treinarmos =)

Vamos testar alguns outros __métodos__ disponíveis para os DaataFrames:

In [52]:
# Mostra as dimensões da DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

__Método head/tail:__ São métodos muito importantes que mostram na tela as primeiras e últimas linhas respectivamente de um __DataFrame__:

In [11]:
# Mostra as primeiras 10 linhas do DataFrame
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [12]:
# Mostra as ultimas 10 linhas do DataFrame
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# Mostra a porcentagem de sobreviventes do Titanic

In [ ]:
# Mostra a Contagem de Sobreviventes no Titanic

##

## Exercícios

### Para o Dataframe do Titanic

**1)** Faça a leitura do Dataframe e mostre as 5 primeiras linhas

In [39]:
df = pd.read_csv('titanic.csv')
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**2)** Calcule a tarifa média por Sexo

In [43]:
df[df['Sex'] == 'female']['Fare'].mean()

44.47981783439487

In [44]:
df[df['Sex'] == 'male']['Fare'].mean()

25.523893414211418

**3)** Determine o passageiro que pagou a maior tarifa

In [51]:
df[df['Fare'] == df['Fare'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

**4)** Determine a idade média dos sobreviventes

In [48]:
df[df['Survived'] == 1]['Age'].mean()

28.343689655172415

In [49]:
df[df['Survived'] == 1]['Pclass'].value_counts(normalize=True)

1    0.397661
3    0.347953
2    0.254386
Name: Pclass, dtype: float64

## Desafio

1 - Escolha um dataset do [Kaggle](https://www.kaggle.com/), explore seus dados e traga uma informação interessante que você encontrou. Esta prática é bastante importante para familizariação com a exploração de dataframes

## Links, Artigos e Referências:

- [Documentação do Pandas](https://pandas.pydata.org/docs/), documentação onde vocês podem encontrar mais informações sobre os métodos e funções do Pandas e descobrir novos métodos que não foram apresentados no curso;
- ["10 Python Pandas Tricks that make your work more efficient",](https://towardsdatascience.com/10-python-pandas-tricks-that-make-your-work-more-efficient-2e8e483808ba) artigo escrito pelo Towards Data Science;
- ["28 useful Pandas functions you might not know"](https://paulovasconcellos.com.br/28-useful-pandas-functions-you-might-not-know-de42c59db085https://medium.com/@zachary.bedell/writing-beautiful-code-with-numpy-505f3b353174), artigo escrito por Paulo Vasconcellos para o Data Hackers;